gokugoku-kun/rx72t_dataflash_test/firm/src/r_datfrx_rx/r_datfrx_rx/src/flash_type_1/r_dm_1.c
/************************************************************************************************
* DISCLAIMER
* This software is supplied by Renesas Electronics Corporation and is only
* intended for use with Renesas products. No other uses are authorized. This
* software is owned by Renesas Electronics Corporation and is protected under
* all applicable laws, including copyright laws.
* THIS SOFTWARE IS PROVIDED "AS IS" AND RENESAS MAKES NO WARRANTIES REGARDING
* THIS SOFTWARE, WHETHER EXPRESS, IMPLIED OR STATUTORY, INCLUDING BUT NOT
* LIMITED TO WARRANTIES OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE
* AND NON-INFRINGEMENT. ALL SUCH WARRANTIES ARE EXPRESSLY DISCLAIMED.
* TO THE MAXIMUM EXTENT PERMITTED NOT PROHIBITED BY LAW, NEITHER RENESAS
* ELECTRONICS CORPORATION NOR ANY OF ITS AFFILIATED COMPANIES SHALL BE LIABLE
* FOR ANY DIRECT, INDIRECT, SPECIAL, INCIDENTAL OR CONSEQUENTIAL DAMAGES FOR
* ANY REASON RELATED TO THIS SOFTWARE, EVEN IF RENESAS OR ITS AFFILIATES HAVE
* BEEN ADVISED OF THE POSSIBILITY OF SUCH DAMAGES.
* Renesas reserves the right, without notice, to make changes to this software
* and to discontinue the availability of this software. By using this software,
* you agree to the additional terms and conditions found by accessing the
* following link:
* http://www.renesas.com/disclaimer
*
* Copyright (C) 2018(2024) Renesas Electronics Corporation. All rights reserved.
*************************************************************************************************/
/************************************************************************************************
* File Name    : r_dm_1.c
* Version      : 2.30
* Description  : DATFRX interface source file
*************************************************************************************************/
/************************************************************************************************
* History      : DD.MM.YYYY Version  Description
*              : 28.09.2018 2.00     First Release
*              : 25.01.2019 2.01     English PDF added, Fixed blank check processing and Busy check procedure
*              : 31.08.2023 2.20     Compatible with RX140
*              : 14.03.2024 2.30     Delete the following macro judgments.
*                                    "FLASH_CFG_CODE_FLASH_ENABLE"
*                                    "FLASH_CFG_CODE_FLASH_BGO"
*                                    "FLASH_CFG_DATA_FLASH_BGO" 
*                                    "FLASH_CF_BLOCK_SIZE"
*                                    "FLASH_HAS_ROM_CACHE"
*************************************************************************************************/

/************************************************************************************************
Includes <System Includes> , "Project Includes"
*************************************************************************************************/
#include "r_dm_1.h"

#if(FLASH_TYPE == FLASH_TYPE_1)
/************************************************************************************************
Macro definitions
*************************************************************************************************/

/************************************************************************************************
Local Typedef definitions
*************************************************************************************************/

/************************************************************************************************
Exported global functions (to be accessed by other files)
*************************************************************************************************/
/* This variable may pass a value to the FLASH.
   Be careful. */
flash_dm_t       gs_flash_dm_b_data[FLASH_DM_PRG_BUF_INDEX];    /* Value of program      */

/************************************************************************************************
Private global variables and functions
*************************************************************************************************/
extern st_flash_dispatch_1_hndl_t* (g_flash_dispatch_1_hndl);
static uint8_t          r_flash_dm_drvif_overwrite(flash_dm_ptr_t addr, flash_dm_t value);
static uint8_t          r_flash_dm_block_copy_setup(void);
static uint8_t          r_flash_dm_block_fill_setup(void);
static e_flash_dm_state_t r_flash_dm_block_program_setup(void);
static uint16_t         gs_flash_dm_b_counter;          /* Counter of program                   */
static uint8_t          gs_flash_dm_b_unit;             /* Unit of program                      */
static uint8_t          gs_flash_dm_c_mode;             /* Mode of command (Erase or program)   */
static const uint8_t    gs_flash_dm_transfer_unit = FLASH_DF_MIN_PGM_SIZE; /* Burst write unit */
uint32_t                g_flash_dm_err_flg;


/* **** Data Flash Setting **** */
/* Information of blocks */
static st_flash_dm_block_t gs_flash_dm_block_info[FLASH_DM_CFG_DF_BLOCK_NUM];

/* Physical block addresses of data flash */
const flash_dm_ptr_t g_r_flash_dm_block_addr[] =
{
    /* cast from uint32_t to flash_dm_ptr_t */
    (flash_dm_ptr_t)FLASH_DF_BLOCK_0,
    /* cast from uint32_t to flash_dm_ptr_t */
    (flash_dm_ptr_t)FLASH_DF_BLOCK_1,
#if (FLASH_DM_CFG_DF_BLOCK_NUM == 2)
#else
    /* cast from uint32_t to flash_dm_ptr_t */
    (flash_dm_ptr_t)FLASH_DF_BLOCK_2,
#if (FLASH_DM_CFG_DF_BLOCK_NUM == 3)
#else
    /* cast from uint32_t to flash_dm_ptr_t */
    (flash_dm_ptr_t)FLASH_DF_BLOCK_3,
#if (FLASH_DM_CFG_DF_BLOCK_NUM == 4)
#else
    /* cast from uint32_t to flash_dm_ptr_t */
    (flash_dm_ptr_t)FLASH_DF_BLOCK_4,
#if (FLASH_DM_CFG_DF_BLOCK_NUM == 5)
#else
    /* cast from uint32_t to flash_dm_ptr_t */
    (flash_dm_ptr_t)FLASH_DF_BLOCK_5,
#if (FLASH_DM_CFG_DF_BLOCK_NUM == 6)
#else
    /* cast from uint32_t to flash_dm_ptr_t */
    (flash_dm_ptr_t)FLASH_DF_BLOCK_6,
#if (FLASH_DM_CFG_DF_BLOCK_NUM == 7)
#else
    /* cast from uint32_t to flash_dm_ptr_t */
    (flash_dm_ptr_t)FLASH_DF_BLOCK_7,
#if (FLASH_DM_CFG_DF_BLOCK_NUM == 8)
#else
    /* cast from uint32_t to flash_dm_ptr_t */
    (flash_dm_ptr_t)FLASH_DF_BLOCK_8,
#if (FLASH_DM_CFG_DF_BLOCK_NUM == 9)
#else
    /* cast from uint32_t to flash_dm_ptr_t */
    (flash_dm_ptr_t)FLASH_DF_BLOCK_9,
#if (FLASH_DM_CFG_DF_BLOCK_NUM == 10)
#else
    /* cast from uint32_t to flash_dm_ptr_t */
    (flash_dm_ptr_t)FLASH_DF_BLOCK_10,
#if (FLASH_DM_CFG_DF_BLOCK_NUM == 11)
#else
    /* cast from uint32_t to flash_dm_ptr_t */
    (flash_dm_ptr_t)FLASH_DF_BLOCK_11,
#if (FLASH_DM_CFG_DF_BLOCK_NUM == 12)
#else
    /* cast from uint32_t to flash_dm_ptr_t */
    (flash_dm_ptr_t)FLASH_DF_BLOCK_12,
#if (FLASH_DM_CFG_DF_BLOCK_NUM == 13)
#else
    /* cast from uint32_t to flash_dm_ptr_t */
    (flash_dm_ptr_t)FLASH_DF_BLOCK_13,
#if (FLASH_DM_CFG_DF_BLOCK_NUM == 14)
#else
    /* cast from uint32_t to flash_dm_ptr_t */
    (flash_dm_ptr_t)FLASH_DF_BLOCK_14,
#if (FLASH_DM_CFG_DF_BLOCK_NUM == 15)
#else
    /* cast from uint32_t to flash_dm_ptr_t */
    (flash_dm_ptr_t)FLASH_DF_BLOCK_15,
#if (FLASH_DM_CFG_DF_BLOCK_NUM == 16)
#else
    /* cast from uint32_t to flash_dm_ptr_t */
    (flash_dm_ptr_t)FLASH_DF_BLOCK_16,
#if (FLASH_DM_CFG_DF_BLOCK_NUM == 17)
#else
    /* cast from uint32_t to flash_dm_ptr_t */
    (flash_dm_ptr_t)FLASH_DF_BLOCK_17,
#if (FLASH_DM_CFG_DF_BLOCK_NUM == 18)
#else
    /* cast from uint32_t to flash_dm_ptr_t */
    (flash_dm_ptr_t)FLASH_DF_BLOCK_18,
#if (FLASH_DM_CFG_DF_BLOCK_NUM == 19)
#else
    /* cast from uint32_t to flash_dm_ptr_t */
    (flash_dm_ptr_t)FLASH_DF_BLOCK_19,
#if (FLASH_DM_CFG_DF_BLOCK_NUM == 20)
#else
    /* cast from uint32_t to flash_dm_ptr_t */
    (flash_dm_ptr_t)FLASH_DF_BLOCK_20,
#if (FLASH_DM_CFG_DF_BLOCK_NUM == 21)
#else
    /* cast from uint32_t to flash_dm_ptr_t */
    (flash_dm_ptr_t)FLASH_DF_BLOCK_21,
#if (FLASH_DM_CFG_DF_BLOCK_NUM == 22)
#else
    /* cast from uint32_t to flash_dm_ptr_t */
    (flash_dm_ptr_t)FLASH_DF_BLOCK_22,
#if (FLASH_DM_CFG_DF_BLOCK_NUM == 23)
#else
    /* cast from uint32_t to flash_dm_ptr_t */
    (flash_dm_ptr_t)FLASH_DF_BLOCK_23,
#if (FLASH_DM_CFG_DF_BLOCK_NUM == 24)
#else
    /* cast from uint32_t to flash_dm_ptr_t */
    (flash_dm_ptr_t)FLASH_DF_BLOCK_24,
#if (FLASH_DM_CFG_DF_BLOCK_NUM == 25)
#else
    /* cast from uint32_t to flash_dm_ptr_t */
    (flash_dm_ptr_t)FLASH_DF_BLOCK_25,
#if (FLASH_DM_CFG_DF_BLOCK_NUM == 26)
#else
    /* cast from uint32_t to flash_dm_ptr_t */
    (flash_dm_ptr_t)FLASH_DF_BLOCK_26,
#if (FLASH_DM_CFG_DF_BLOCK_NUM == 27)
#else
    (flash_dm_ptr_t)FLASH_DF_BLOCK_27,
#if (FLASH_DM_CFG_DF_BLOCK_NUM == 28)
#else
    /* cast from uint32_t to flash_dm_ptr_t */
    (flash_dm_ptr_t)FLASH_DF_BLOCK_28,
#if (FLASH_DM_CFG_DF_BLOCK_NUM == 29)
#else
    /* cast from uint32_t to flash_dm_ptr_t */
    (flash_dm_ptr_t)FLASH_DF_BLOCK_29,
#if (FLASH_DM_CFG_DF_BLOCK_NUM == 30)
#else
    /* cast from uint32_t to flash_dm_ptr_t */
    (flash_dm_ptr_t)FLASH_DF_BLOCK_30,
#if (FLASH_DM_CFG_DF_BLOCK_NUM == 31)
#else
    /* cast from uint32_t to flash_dm_ptr_t */
    (flash_dm_ptr_t)FLASH_DF_BLOCK_31

