gokugoku-kun/rx72t_dataflash_test/firm/src/r_datfrx_rx/r_datfrx_rx/src/flash_type_1/r_dm_1.c
    return 0;
} /* End of function r_flash_dm_drvif_overwrite() */

/************************************************************************************************
* Function Name: r_flash_dm_drvif_api_flag
* Description  : Checks API flag.
* Arguments    : st_flash_dispatch_1_hndl_t * p_hndl   ; FLASH DM information
* Return Value : 1: Unlock
*              : 0: Lock
*------------------------------------------------------------------------------------------------
* Notes        : If control the code flash, place the source code to the RAM.
*************************************************************************************************/
uint8_t r_flash_dm_drvif_api_flag(st_flash_dispatch_1_hndl_t * p_hndl)
{
    /* cast from uint32_t to uint32_t */
    int32_t is_locked = FLASH_DM_API_CALL;

    /* ==== Check API calling ==== */
    xchg(&is_locked, &p_hndl->api_call);
    /* cast from uint32_t to uint32_t */
    if (FLASH_DM_API_CALL == is_locked)
    {
        return 1;   /* Unlock */
    }
    return 0;       /* Lock */
}

/************************************************************************************************
* Function Name: r_flash_dm_drvif_write
* Description  : Writes the data.
* Arguments    : flash_dm_ptr_t     p_addr      ; Pointer to the write address
*              : flash_dm_ptr_t     p_value     ; Pointer to the write value
* Return Value : FLASH_DM_ACCEPT                ; Successful operation
*              : FLASH_DM_ERR                   ; Error
*------------------------------------------------------------------------------------------------
* Notes        : If control the code flash, place the source code to the RAM.
*************************************************************************************************/
e_flash_dm_status_t r_flash_dm_drvif_write(flash_dm_ptr_t p_addr, flash_dm_ptr_t p_value)
{
    flash_err_t ret = FLASH_SUCCESS; /* debug */
#if !defined(FLASH_DM_DEBUG)
    g_flash_dm_err_flg = 0;
#endif /* !defined(FLASH_DM_DEBUG) */

    /* ==== Write data. ==== */
    g_flash_dispatch_1_hndl->flash_state = DATF_FLASH_CALL;
    /* cast from uint32_t to uint32_t */
    ret = R_FLASH_Write((uint32_t)p_value, (uint32_t)p_addr, (uint32_t)FLASH_DF_MIN_PGM_SIZE);
    if(ret != FLASH_SUCCESS)
    {

        g_flash_dm_err_flg = 1;

        return FLASH_DM_ERR;
    }

    return FLASH_DM_ACCEPT;
} /* End of function r_flash_dm_drvif_write() */

/************************************************************************************************
* Function Name: r_flash_dm_drvif_erase
* Description  : Erases the 1 block.
* Arguments    : flash_dm_ptr_t     p_addr  ; Pointer to the erase block address
* Return Value : FLASH_DM_ACCEPT            ; Successful operation
*              : FLASH_DM_ERR               ; Error
*------------------------------------------------------------------------------------------------
* Notes        : If control the code flash, place the source code to the RAM.
*************************************************************************************************/
e_flash_dm_status_t r_flash_dm_drvif_erase(flash_dm_ptr_t p_addr)
{
#if !defined(FLASH_DM_DEBUG)
    g_flash_dm_err_flg = 0;
#endif /* !defined(FLASH_DM_DEBUG) */

    /* ==== Erase block. ==== */
    g_flash_dispatch_1_hndl->flash_state = DATF_FLASH_CALL;
    /* cast from uint8_t to uint8_t */
    if (R_FLASH_Erase((flash_block_address_t)p_addr, 1) != FLASH_SUCCESS)
    {
        g_flash_dm_err_flg = 1;

        return FLASH_DM_ERR;
    }

    return FLASH_DM_ACCEPT;
} /* End of function r_flash_dm_drvif_erase() */


/************************************************************************************************
* Function Name: r_flash_dm_block_init
* Description  : Initializes block variables.
* Arguments    : None
* Return Value : 1: Successful operation
*              : 0: Error
*------------------------------------------------------------------------------------------------
* Notes        : None
*************************************************************************************************/
uint8_t r_flash_dm_block_init(void)
{
    uint8_t b_ret = 0;

    gs_flash_dm_b_unit = gs_flash_dm_transfer_unit;
    b_ret = r_flash_dm_drvif_init_device();
    return b_ret;
} /* End of function r_flash_dm_block_init() */

/************************************************************************************************
* Function Name: r_flash_dm_block_program_init
* Description  : Initializes block program variables.
* Arguments    : flash_dm_ptr_t     p_src   ; Pointer of the start address of source
*              : uint16_t           counter ; Counter of program
*              : flash_dm_t         data    ; Value of program
* Return Value : None
*------------------------------------------------------------------------------------------------
* Notes        : None
*************************************************************************************************/
void r_flash_dm_block_program_init(flash_dm_ptr_t p_src, uint16_t counter, flash_dm_t data)
{
    uint8_t index = 0;

    g_flash_dispatch_1_hndl->flash_dm_a_src = p_src;
    gs_flash_dm_b_counter = counter;
    /* WAIT_LOOP */
    for (index = 0; index < FLASH_DM_PRG_BUF_INDEX; index++)
    {
        gs_flash_dm_b_data[index] = data;
    }
    /* cast from uint8_t to uint8_t */
    gs_flash_dm_c_mode = FLASH_DM_MODE_PROGRAM;
} /* End of function r_flash_dm_block_program_init() */

/************************************************************************************************
* Function Name: r_flash_dm_block_erase_init
* Description  : Initializes block erase variables.
* Arguments    : None
* Return Value : None
*------------------------------------------------------------------------------------------------
* Notes        : None
*************************************************************************************************/
void r_flash_dm_block_erase_init(void)
{
    /* cast from uint8_t to uint8_t */
    gs_flash_dm_c_mode = FLASH_DM_MODE_ERASE;
} /* End of function r_flash_dm_block_erase_init() */

/************************************************************************************************
* Function Name: r_flash_dm_block_copy_setup
* Description  : Checks program completion and set program data.
* Arguments    : None
* Return Value : 1: Not finish program and set program data.
*              : 0: Finish program
*------------------------------------------------------------------------------------------------
* Notes        : None
*************************************************************************************************/
static uint8_t r_flash_dm_block_copy_setup(void)
{
    uint8_t index = 0;

