gokugoku-kun/rx72t_dataflash_test/firm/src/r_datfrx_rx/r_datfrx_rx/src/flash_type_1/r_dm_1.c
    if (FLASH_INT_EVENT_ERR_DF_ACCESS <= ready_event->event)
    {
        g_flash_dm_err_flg = 1; /* Error */
    }

    g_flash_dispatch_1_hndl->flash_state = DATF_FLASH_IDLE;/* Due to call APIs. */

    switch (ready_event->event)
    {
        case    FLASH_INT_EVENT_ERASE_COMPLETE:
        case    FLASH_INT_EVENT_WRITE_COMPLETE:
        {
            g_flash_dispatch_1_hndl->error_code = r_flash_dm_advance();
        }
        break;

        default:
        {
            /* Do Nothing */
        }
        break;
    }

    if (0 != r_flash_dm_callbackfunc)
    {
        if(g_flash_dispatch_1_hndl->error_code == FLASH_DM_ERR_REQUEST_INIT)
        {
            switch(g_flash_dispatch_1_hndl->activity)
            {
                case    FLASH_DM_ACT_FORMATTING:
                {
                    /* cast from e_flash_dm_status_t to void* */
                    r_flash_dm_callbackfunc((void*)FLASH_DM_ERR_FORMAT);
                }
                break;

                case    FLASH_DM_ACT_WRITING:
                {
                    /* cast from e_flash_dm_status_t to void* */
                    r_flash_dm_callbackfunc((void*)FLASH_DM_ERR_WRITE);
                }
                break;

                case    FLASH_DM_ACT_ERASING:
                {
                    /* cast from e_flash_dm_status_t to void* */
                    r_flash_dm_callbackfunc((void*)FLASH_DM_ERR_ERASE);
                }
                break;

                case    FLASH_DM_ACT_RECLAIMING:
                {
                    /* cast from e_flash_dm_status_t to void* */
                    r_flash_dm_callbackfunc((void*)FLASH_DM_ERR_RECLAIM);
                }
                break;

                default :
                {
                    r_flash_dm_callbackfunc((void*)FLASH_DM_ERR);
                }
            }
        }
    }
}

/************************************************************************************************
* Function Name: r_flash_dm_set_dm
* Description  : Copy the handle's address.
* Arguments    : uint32_t   handle   ; Current handle
* Return Value : void
*------------------------------------------------------------------------------------------------
* Notes        : None
*************************************************************************************************/
void r_flash_dm_set_dm(uint32_t handle)
{
    /* cast from uint32_t to st_flash_dispatch_1_hndl_t* */
    g_flash_dispatch_1_hndl = (st_flash_dispatch_1_hndl_t*)handle;
}

#endif /* (FLASH_TYPE == FLASH_TYPE_1) */

/* End of File */

